const weatherLogoMap = {
  '晴': '☀️',
  '少云': '🌤',
  '晴间多云': '🌤',
  '多云': '🌥',
  '阴': '☁️',
  '有风': '🎐',
  '平静': '😌',
  '微风': '🎐',
  '和风': '🪁',
  '清风': '🪁',
  '强风/劲风': '🌬︎',
  '疾风': '🌬︎',
  '大风': '🌬︎',
  '烈风': '🌬︎',
  '风暴': '🌪',
  '狂爆风': '🌪',
  '飓风': '🌪',
  '热带风暴': '🌀',
  '霾': '🌫',
  '中度霾': '🌁',
  '重度霾': '🌁🌁',
  '严重霾': '🌁🌁🌁',
  '阵雨': '🌧',
  '雷阵雨': '⛈',
  '雷阵雨并伴有冰雹': '⛈🧊',
  '小雨': '🌧',
  '中雨': '🌧',
  '大雨': '🌧',
  '暴雨': '🌧🌧',
  '大暴雨': '🌧🌧🌧',
  '特大暴雨': '🌧🌧🌧🌧',
  '强阵雨': '🌧',
  '强雷阵雨': '⛈⛈',
  '极端降雨': '⛈⛈⛈',
  '毛毛雨/细雨': '🌧',
  '雨': '🌧',
  '小雨-中雨': '🌧',
  '中雨-大雨': '🌧🌧',
  '大雨-暴雨': '🌧🌧🌧',
  '暴雨-大暴雨': '🌧🌧🌧🌧',
  '大暴雨-特大暴雨': '🌧🌧🌧🌧🌧',
  '雨雪天气': '🌧🌨',
  '雨夹雪': '🌧🌨',
  '阵雨夹雪': '🌧🌨',
  '冻雨': '🌧🧊',
  '雪': '❄️',
  '阵雪': '❄️❄️❄️',
  '小雪': '❄️',
  '中雪': '❄️',
  '大雪': '❄️',
  '暴雪': '❄️❄️❄️❄️',
  '小雪-中雪': '❄️',
  '中雪-大雪': '❄️❄️',
  '大雪-暴雪': '❄️❄️❄️',
  '浮尘': '🤧',
  '扬沙': '🤧',
  '沙尘暴': '😵',
  '强沙尘暴': '😣',
  '龙卷风': '🌪',
  '雾': '🌫',
  '浓雾': '🌫🌫',
  '强浓雾': '🌫🌫🌫',
  '轻雾': '🌫',
  '大雾': '🌫🌫',
  '特强浓雾' : '🌫🌫🌫🌫',           
  '热': '🥵🥵',
  '冷': '🥶🥶',
}

const dressRecommendationsMap = {
  '≥33': '天气极热，适宜着丝麻、轻棉织物制作的短衣、短裙、薄短裙、短裤等夏季服装。午后尽量减少户外活动，高温条件下作业和露天作业人员采取必要防护措施。',
  '28~33': '天气炎热，适宜着短衫、短裙、短裤、薄型T恤衫、敞领短袖棉衫等夏季服装。',
  '25~28': '天气偏热，适宜着短衫、短裙、短套装、T恤等夏季服装。年老体弱者：单层薄衫裤、薄型棉衫。',
  '20~25': '天气暖和，适宜着单层棉麻面料的短套装、T恤衫、薄牛仔衫裤、休闲服、职业套装等春秋过渡装。',
  '15~20': '天气温凉，适宜着夹衣、马甲衬衫、长裤、夹克衫、西服套装加薄羊毛衫等春秋服装。',
  '5~15': '天气凉，适宜着一到两件羊毛衫、大衣、毛套装、皮夹克等春秋着装。',
  '-15~5': '天气冷，冬季着装：棉衣、羽绒衣、冬大衣、皮夹克、毛衣再外罩大衣等。',
  '<-15': '天气寒冷，冬季着装：棉衣、羽绒服、冬大衣、皮夹克加羊毛衫、厚呢外套、呢帽、手套等。',
}

const dressRecommendations = (min, max) => {
  const avg = (max + min) / 2
  let key = ''
  if (avg >= 33) key = '≥33'
  else if (avg >= 28) key = '28~33'
  else if (avg >= 25) key = '25~28'
  else if (avg >= 20) key = '20~25'
  else if (avg >= 15) key = '15~20'
  else if (avg >= 5) key = '5~15'
  else if (avg >= -15) key = '-15~5'
  else key = '<-15'
  return dressRecommendationsMap[key]
}

exports.weatherLogoMap = weatherLogoMap

exports.dressRecommendations = dressRecommendations
